[
  {
    "id": "PD0020",
    "name": "POCO M6 Plus 5G (Graphite Black, 128 GB)  (6 GB RAM)",
    "image": "https://rukminim2.flixcart.com/image/832/832/xif0q/mobile/i/w/k/-original-imah3afnzmgfjnrf.jpeg?q=70&crop=false",
    "price": "9,999",
    "description": "Snap away with the Segment’s only 108MP camera on a 5G phone and see your photos come to life in stunning detail! The 3x in-sensor zoom lets you capture every intricate detail from a distance, while the 13MP selfie camera ensures your self-portraits are always on point. With 7 film filters to play with, you can add a touch of vintage, drama, or fun to every shot. Get ready to turn every moment into a masterpiece! Embrace the night with confidence, thanks to the AI Night Mode! Whether you’re out in the town or chilling at home, this feature ensures your photos shine even when the lights are low. Say goodbye to grainy, blurry shots and hello to bright, clear images that capture every detail – no matter how dark it gets. With AI Night Mode, your nighttime adventures are always in the spotlight! Turn heads with the Ring Flash Design and sleek premium glass back of your phone. It’s the segment’s only dual-sided glass on a 5G phone, adding a touch of luxury and sophistication to your device. Not only does it look stunning, but it’s also built to shine with style and durability. Whether you’re showing it off or using it day in and day out, this phone combines elegance with cutting-edge design.",
    "rating": 3.9,
    "highlights":[
      "6 GB RAM | 128 GB ROM | Expandable Upto 1 TB",
      "17.25 cm (6.79 inch) Full HD+ Display",
      "108MP + 2MP | 13MP Front Camera",
      "5030 mAh Battery",
      "Snapdragon 4 Gen2 AE Processor"
    ],
    "link": "https://www.flipkart.com/poco-m6-plus-5g-graphite-black-128-gb/p/itm82a1353906425?pid=MOBH2M2DN8ZFH7XK&lid=LSTMOBH2M2DN8ZFH7XKSXYCSZ&marketplace=FLIPKART&q=POCO+M6+Plus+5G&store=tyy%2F4io&srno=s_1_3&otracker=search&otracker1=search&fm=organic&iid=76d5dc5d-c9c3-44a7-9c83-445b514d2bf5.MOBH2M2DN8ZFH7XK.SEARCH&ppt=hp&ppn=homepage&ssid=g4v9es96z40000001750773489368&qH=ded418105701ce9c"
  }
]
