[
  {
    "id": "PD0001",
    "name": "vivo T4 Ultra 5G (Phoenix Gold, 256 GB)  (8 GB RAM)",
    "image": "https://rukminim2.flixcart.com/image/832/832/xif0q/mobile/s/v/h/-original-imahd57g62dfepkh.jpeg?q=70&crop=false",
    "price": "37,999",
    "description": "50 MP dual Sony sensors, 3x periscope OIS camera, and studio-quality aura light for perfect shots. Vivo Origin Imaging Engine: Capture stunning stage portraits with flagship periscope zoom, enhancing facial details and natural skin tones effortlessly. The flagship-level periscope telephoto camera, paired with proprietary optimisation algorithms, achieves superior stage portrait performance in its price range, with clear facial details, natural skin tones, and a vivid, striking look. Capture every detail with 10x Telephoto Macro, bringing close-ups to life. Capture clear, stunning shots with 3x optical, 10x HD, and up to 100x digital zoom, enhanced by advanced image optimisation.Both rear and front cameras support recording Ultra HD 4K videos. Be it random life details or quality selfies and vlogs, you can always capture life's beauty with stunning clarity. The Dimensity 9300+ processor boosts performance for a smoother, faster experience. A long-lasting 5500 mAh battery keeps you powered, ensuring uninterrupted connection and use. Power up in no time with 90 W FlashCharge, keeping you ready for anything. Dominate your games with Ultra Game Mode and 4D Game vibration for an immersive gaming experience.",
    "rating": 4.7
  },
  {
    "id": "PD0002",
    "name": "Infinix GT 30 Pro 5G+ (Blade White, 256 GB)  (12 GB RAM)",
    "image": "https://rukminim2.flixcart.com/image/832/832/xif0q/mobile/4/x/r/-original-imahddjyr6ch3xev.jpeg?q=70&crop=false",
    "price": "26,999",
    "description": "The GT 30 Pro is officially certified by Krafton for 120 FPS gaming on BGMI, ensuring ultra-smooth gameplay with reduced motion blur and faster touch response. This high frame rate offers a competitive edge in fast-paced battles, delivering more fluid visuals and improved accuracy, ideal for gamers who want a seamless and responsive experience. Equipped with MediaTek Dimensity 8350 ULTIMATE processor, the GT 30 Pro offers blazing-fast performance, fluid gaming, and effortless multitasking. With the advanced MediaTek HyperEngine Adaptive Gaming Technology, this powerhouse processor promises up to 24% faster game scene change. Get ready to enjoy gaming like never before with GT Shoulder Triggers! These capacitive triggers can enhance mobile gaming by providing console-like input, reducing reliance on on-screen controls, and keeping the display unobstructed. Beyond gaming, they can also be customized for quick access to functions like taking photos or controlling media playback, adding to the phone’s overall usability.",
    "rating": 4.6
  },
  {
    "id": "PD0003",
    "name": "MOTOROLA Razr 60 (PANTONE Lightest Sky, 256 GB)  (8 GB RAM)",
    "image": "https://rukminim2.flixcart.com/image/832/832/xif0q/mobile/2/l/g/-original-imahcqupncz6d9zz.jpeg?q=70&crop=false",
    "price": "49,999",
    "description": "Say hello to the hottest flip phone in town, packed with dangerously cool features that are sure to turn heads. It boasts the world’s first flip with video gestures on an external display, allowing you to record and capture effortlessly with simple hand gestures. Style meets innovation with Pantone-curated colour finishes, including India’s first marble finish, Acetate, the world’s first fabric finish, Nylon-inspired, and a sleek Vegan Leather option. Equipped with motoAI, the phone's advanced camera system lets you capture content in multiple ways. Start, stop, and pause video recording, or even begin a countdown for a selfie using cool video gestures. Raise an open palm to start a countdown for taking a photo or starting a video. To pause while recording, turn your palm into a fist and hold it, then simply open your palm again to resume. To stop recording, show a steady clenched fist, and the video will end after a short countdown.",
    "rating": 4.6
  },
  {
    "id": "PD0004",
    "name": "realme 14 Pro+ 5G (Pearl White, 256 GB)  (8 GB RAM)",
    "image": "https://rukminim2.flixcart.com/image/832/832/xif0q/mobile/b/j/x/-original-imah8ffzxggep6dz.jpeg?q=70&crop=false",
    "price": "31,999",
    "description": "A 3x periscope camera enhances your phone's zooming capabilities, allowing you to capture stunning close-up shots from a distance with sharp details and minimal distortion. The 3x optical zoom ensures crystal-clear images without compromising quality. You can now capture stunning, DSLR-level shots from your sleek phone. Powered by the Snapdragon 7s Gen 3 5G chipset, your phone delivers lightning-fast performance and ultra-smooth multitasking. Whether you're gaming, streaming, or juggling multiple apps, it ensures everything runs effortlessly—keeping up with your pace, every step of the way. The unique pearl design radiates sophistication, blending fashion with elegance, so you can carry a touch of luxury wherever you go. Enjoy an immersive, edge-to-edge experience with the bezel-less quad-curve display. It looks sleek and also feels comfortable in your hand, making every swipe and touch more fluid. The curves bring your content to life while adding a premium touch to your device.",
    "rating": 4.4
  },
  {
    "id": "PD0005",
    "name": "MOTOROLA Edge 60 Pro (Pantone Dazzling Blue, 256 GB)  (12 GB RAM)",
    "image": "https://rukminim2.flixcart.com/image/832/832/xif0q/mobile/x/b/i/-original-imahcrpw8err3xrc.jpeg?q=70&crop=false",
    "price": "33,999",
    "description": "Upgrade to a stunning quad-curved glass design that fits perfectly in your hand. Featuring an ultrathin frame, rounded corners, and a soft-touch finish, it offers a premium feel. Experience ultimate style and comfort with every touch. Edge into pro with the Motorola Edge’s camera, powered by Moto AI. The 50MP main sensor delivers sharp shots in any light, while Ultra HDR boosts color. Adaptive Stabilization keeps your vids smooth. Ultrawide, macro, and telephoto lenses capture every angle. Pantone validation keeps colors true, and 4K HDR10+ video takes your content to the next level. Edge into personalized assistance with Moto AI, putting intelligent features at your fingertips. Get smart summaries with Catch Me Up, real-time transcription with Pay Attention, and personalized memory recall with Remember This. Stay organized and connected with Global Search and Next Move, all customized to fit your needs. Use the AI Key for easy access, Circle to search for visual exploration, or chat naturally with Gemini Live. With Moto AI, your phone’s not just smart, it’s ahead of the game.",
    "rating": 4.4
  }
]
